import React, {useState} from 'react';
import s from './Accordion.module.css'

const accordionData = [
    {
        heading: "Скільки часу виготовляються меблі?",
        content: "Термін виготовлення меблів залежить від багатьох факторів: об’єми, тип меблів, тип матеріалів, складність роботи, погодження та внесення змін у проєкт. \n" +
            "Ми цінуємо час клієнтів, тому наша команда майстрів навіть найскладніші об’єкти виготовляємо за 21 день. Більш прості корпусні меблі або декор виготовляємо за 10-14 робочих днів."
    },
    {
        heading: "Чому немає цін на вироби?",
        content: "Ми не виготовляємо стандартні фабричні меблі. Кожна наша робота – це реалізація індивідуального дизайнерського проєкту. Ціна залежить від багатьох факторів: об’єму, матеріалів, фурнітури, комплектації та від складності дизайнерського рішення. \n" +
            "Та наші менеджери завжди готові надати вам професійну консультацію на першому етапі та зробити безкоштовний розрахунок ціни вашого проєкту. \n"

    },
    {
        heading: "Хто розробляє дизайн проєкту?",
        content: "Якщо ви не маєте готового дизайнерського проєкту - наш дизайнер без проблем втілить всі ваші неймовірні ідеї та допоможе обрати найкращі рішення. \n" +
            "Якщо ж ви маєте проєкт, ми без проблем допоможемо реалізувати його та знайти найоптимальніші варіанти.\n"
    },
    {
        heading: "Чому так дорого?",
        content: "На перший погляд справді може здатися, що меблі на замовлення набагато дорожчі за фабричні меблі. Та якщо глянути на наповнення, до прикладу, двох шаф, вони можуть сильно відрізнятися по використаних матеріалах (їх якістю, вологостійкістю і тд), кількість полиць, товщина плит, вид фурнітури і багато інших факторів, що безпосередньо впливають на ціну, Краще довготривале задоволення від якості ваших меблів, ніж короткотривале від їх ціни.\n" +
            "Наші менеджери завжди допоможуть вам знайти найкращі дизайн-рішення та матеріали саме під ваш бюджет.\n"
    },
    {
        heading: "Чому ви соціальна майстерня?",
        content: "Наша місія – створювати зручні, атмосферні меблі, які відповідають індивідуальному стилю, залучаючи до роботи людей із вразливих груп населення. Ми працевлаштовуємо чоловіків, які пройшли реабілітацію від алко- та наркозалежності в реабілітаційних центрах “Добро”, “Step by step”, “Кроки”, що у Львові, а також тих, які повернулися з АТО.\n" +
            "А також матеріально підтримуємо благодійну організацію Львівська освітня платформа. Яка має програми спрямовані на допомогу родинам, які з різних причин опинились в скрутному становищі, а також на активізацію громад на мікрорівнях. Для підтримки програми ми перераховуємо 10% з чистого доходу майстерні.\n" +
            "Тож коли ви співпрацюєте з нами ви не просто отримуєте якісні та зручні меблі, а також долучаєтесь до благодійної справи.\n"
    },
];

const Accordion = ({heading, content}) => {
    const [isActive, setIsActive] = useState(false);
    return (
        <li className={s.accordion_item}>
            <div className={s.accordion_toggle}
                 onClick={() => setIsActive(!isActive)}>
                <h3>{heading}</h3><span>{isActive ? "-" : "+"}</span>
            </div>
            <div className={s.contentOverlay}>
                {isActive &&
                    <div className={s.accordion_content}>{content}</div>}
            </div>
        </li>
    );
};


const Accord = () => {
    return (
        <div className={s.overlay}>
            <ul className={s.accordion}>
                {accordionData.map(({heading, content, index }) => (
                    <Accordion heading={heading}
                               content={content}
                               key={index}
                    />
                ))}
            </ul>
        </div>
    );
};

export default Accord;

